; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	GroundStation4 - direction
	Star9 - direction
	GroundStation12 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Star3 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star13 - direction
	GroundStation8 - direction
	GroundStation14 - direction
	GroundStation7 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation14)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation10)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star13)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation12)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation8)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star11)
	(supports instrument6 spectrograph3)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star19)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 thermograph2)
	(have_image Star17 spectrograph1)
	(have_image Phenomenon18 thermograph2)
	(have_image Star19 spectrograph1)
	(have_image Phenomenon20 spectrograph1)
	(have_image Star21 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 star16 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 star16)
   goals met: 0 of 8
5. (take_image satellite1 star16 instrument1 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon20 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 phenomenon20)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon20 instrument1 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon18 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon18)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon18 instrument1 thermograph2)
   added: (have_image phenomenon18 thermograph2)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon15 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 8
12. (turn_to satellite0 star19 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star19)
   goals met: 5 of 8
13. (turn_to satellite1 star17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star17)
   goals met: 5 of 8
14. (take_image satellite1 star17 instrument1 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 6 of 8
15. (turn_to satellite1 star19 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star19)
   goals met: 6 of 8
16. (take_image satellite1 star19 instrument1 spectrograph1)
   added: (have_image star19 spectrograph1)
   goals met: 7 of 8
17. (turn_to satellite1 star21 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 star21)
   goals met: 7 of 8
18. (take_image satellite1 star21 instrument1 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 8 of 8
